app/controllers/texts_controller.rb

  	def send_text
	   	a = Todo.find(params[:id])
---
SELECT  "todos".* FROM "todos" WHERE "todos"."id" = ? LIMIT 1  [["id", 2]]