app/controllers/todos_controller.rb

INSERT INTO "todos" ("text", "completion_date", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["text", "Hi "], ["completion_date", "2016-05-12 00:00:00.000000"], ["created_at", "2015-07-18 18:30:46.343946"], ["updated_at", "2015-07-18 18:30:46.343946"]]
---
def create
	@todo = Todo.new(white_params)
	@todo.save

SELECT  "todos".* FROM "todos" WHERE "todos"."id" = ? LIMIT 1  [["id", 1]]
---
def edit
  @todo = Todo.find(params[:id])

SELECT  "todos".* FROM "todos" WHERE "todos"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "todos" SET "completion_date" = ?, "updated_at" = ? WHERE "todos"."id" = ?  [["completion_date", "2015-07-09 00:00:00.000000"], ["updated_at", "2015-07-19 01:26:48.109467"], ["id", 3]]
---
def update
  @todo = Todo.find(params[:id])
  if @todo.update(white_params)

SELECT  "todos".* FROM "todos" WHERE "todos"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "todos" WHERE "todos"."id" = ?  [["id", 1]]
---
def destroy
  @todo = Todo.find(params[:id])
  if @todo.destroy